STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253dxx_cm33.h
/*!< SMART_RUN_APB peripherals Non secure aliases */
#define RTC_BASE_NS                         (SMART_RUN_APB_PERIPH_BASE_NS + 0x00000UL)
#define TAMP_BASE_NS                        (SMART_RUN_APB_PERIPH_BASE_NS + 0x10000UL)
#define SPI8_BASE_NS                        (SMART_RUN_APB_PERIPH_BASE_NS + 0x20000UL)
#define LPUART1_BASE_NS                     (SMART_RUN_APB_PERIPH_BASE_NS + 0x30000UL)
#define I2C8_BASE_NS                        (SMART_RUN_APB_PERIPH_BASE_NS + 0x40000UL)
#define LPTIM3_BASE_NS                      (SMART_RUN_APB_PERIPH_BASE_NS + 0x50000UL)
#define LPTIM4_BASE_NS                      (SMART_RUN_APB_PERIPH_BASE_NS + 0x60000UL)
#define LPTIM5_BASE_NS                      (SMART_RUN_APB_PERIPH_BASE_NS + 0x70000UL)
#define I3C4_BASE_NS                        (SMART_RUN_APB_PERIPH_BASE_NS + 0x80000UL)
#define IWDG5_BASE_NS                       (SMART_RUN_APB_PERIPH_BASE_NS + 0x90000UL)
#define WWDG2_BASE_NS                       (SMART_RUN_APB_PERIPH_BASE_NS + 0xA0000UL)

/*!< SMART_RUN_AHB peripherals Non secure aliases */
#define GPIOZ_BASE_NS                       (SMART_RUN_AHB_PERIPH_BASE_NS + 0x00000UL)
#define LPDMA_BASE_NS                       (SMART_RUN_AHB_PERIPH_BASE_NS + 0x10000UL)
#define ADF1_BASE_NS                        (SMART_RUN_AHB_PERIPH_BASE_NS + 0x20000UL)
#define ADF1_Filter0_BASE_NS                (ADF1_BASE_NS + 0x80UL)
#define EXTI2_BASE_NS                       (SMART_RUN_AHB_PERIPH_BASE_NS + 0x30000UL)
#define EXTI2_C1_BASE_NS                    (EXTI2_BASE_NS + 0x80UL)
#define EXTI2_C2_BASE_NS                    (EXTI2_BASE_NS + 0xC0UL)
#define EXTI2_C3_BASE_NS                    (EXTI2_BASE_NS + 0x100UL)
#define HSEM_BASE_NS                        (SMART_RUN_AHB_PERIPH_BASE_NS + 0x40000UL)
#define IPCC2_BASE_NS                       (SMART_RUN_AHB_PERIPH_BASE_NS + 0x50000UL)
#define IPCC2_C1_BASE_NS                    (IPCC2_BASE_NS)
#define IPCC2_C2_BASE_NS                    (IPCC2_BASE_NS + 0x10UL)

#define LPDMA_Channel0_BASE_NS              (LPDMA_BASE_NS + 0x0050UL)
#define LPDMA_Channel1_BASE_NS              (LPDMA_BASE_NS + 0x00D0UL)
#define LPDMA_Channel2_BASE_NS              (LPDMA_BASE_NS + 0x0150UL)
#define LPDMA_Channel3_BASE_NS              (LPDMA_BASE_NS + 0x01D0UL)

/*!< APB4 peripherals Non secure aliases */
#define LTDC_BASE_NS                        (APB4_PERIPH_BASE_NS + 0x10000UL)
#define LTDC_Layer1_BASE_NS                 (LTDC_BASE_NS + 0x100UL)
#define LTDC_Layer2_BASE_NS                 (LTDC_BASE_NS + 0x200UL)
#define LTDC_Layer3_BASE_NS                 (LTDC_BASE_NS + 0x300UL)

#define CSI_BASE_NS                         (APB4_PERIPH_BASE_NS + 0x20000UL)
#define DCMIPP_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x30000UL)
#define DDRC_BASE_NS                        (APB4_PERIPH_BASE_NS + 0x40000UL)
#define DDRDBG_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x50000UL)
#define DDRPERFM_BASE_NS                    (DDRC_BASE_NS + 0x1000UL)
#define STGENR_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x70000UL)
#define STGENC_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x80000UL)
#define GICV2M_BASE_NS                      (APB4_PERIPH_BASE_NS + 0x90000UL)
#define UCPD1_BASE_NS                       (APB4_PERIPH_BASE_NS + 0xA0000UL)
#define BUSPERFM_BASE_NS                    (APB4_PERIPH_BASE_NS + 0xB0000UL)
#define USB3PCIEPHY_BASE_NS                 (APB4_PERIPH_BASE_NS + 0xC0000UL)

/*!< AHB5 peripherals Non secure aliases */
#define FMC_BASE_NS                         (AHB5_PERIPH_BASE_NS + 0x000000UL)
#define SDMMC1_BASE_NS                      (AHB5_PERIPH_BASE_NS + 0x020000UL)
#define SDMMC2_BASE_NS                      (AHB5_PERIPH_BASE_NS + 0x030000UL)
#define SDMMC3_BASE_NS                      (AHB5_PERIPH_BASE_NS + 0x040000UL)
#define ETH1_BASE_NS                        (AHB5_PERIPH_BASE_NS + 0x0C0000UL)
#define ETH2_BASE_NS                        (AHB5_PERIPH_BASE_NS + 0x0D0000UL)
#define USBH_OHCI_BASE_NS                   (AHB5_PERIPH_BASE_NS + 0x0E0000UL)
#define USBH_EHCI_BASE_NS                   (AHB5_PERIPH_BASE_NS + 0x0F0000UL)
#define USB3DRD_BASE_NS                     (AHB5_PERIPH_BASE_NS + 0x100000UL)
#define CA35SYSCFG_BASE_NS                  (AHB5_PERIPH_BASE_NS + 0x602000UL)
#define FMC_NAND_DATA_BASE_NS               (AHB5_PERIPH_BASE_NS + 0x610000UL)
#define DDRPHYC_BASE_NS                     (AHB5_PERIPH_BASE_NS + 0xA00000UL)

/*!< APB_DEBUG peripherals Non secure aliases */
#define DBGMCU_BASE_NS                      (APB_DEBUG_PERIPH_BASE_NS + 0x010000UL)

/*!< AHB6 peripherals Non secure aliases */
/*!< FMC Banks registers base address */
#define FMC_Bank1_R_BASE_NS                 (FMC_BASE_NS + 0x0000UL)
#define FMC_Bank1E_R_BASE_NS                (FMC_BASE_NS + 0x0104UL)
#define FMC_Bank3_R_BASE_NS                 (FMC_BASE_NS + 0x0080UL)
#define FMC_Common_R_BASE_NS                (FMC_BASE_NS + 0x0020UL)

#if defined (CORTEX_IN_SECURE_STATE)
/*!< Offset between Non-secure aliases and Secure aliases */
#define  OFFSET_NS_S                        (0x10000000UL)

/*!< Peripherals Secure aliases */
#define PERIPH_BASE_S                       (PERIPH_BASE_NS + OFFSET_NS_S)  /*!< Base address of : AHB/APB Peripherals                  */

/*!< Memories Secure aliases */
#define SRAMS_BASE_S                        (SRAMS_BASE_NS + OFFSET_NS_S) /*!< Base address of : SRAMs region                           */

#define SYSRAM_BASE_S                       (SRAMS_BASE_S + 0x00000000UL)   /*!< Base address of : System RAM accessible over AXI         */
#define SRAM2_BASE_S                        (SRAMS_BASE_S + 0x00060000UL)   /*!< Base address of : static data RAM1                       */
#define SRAM1_BASE_S                        (SRAMS_BASE_S + 0x00040000UL)   /*!< Base address of : static data RAM2                       */
#define RETRAM_BASE_S                       (SRAMS_BASE_S + 0x00080000UL)   /*!< Base address of : Retention RAM                          */
#define VDERAM_BASE_S                       (SRAMS_BASE_S + 0x000A0000UL)   /*!< Base address of : VIDEO ENCODE/DECODE static RAM         */
#define LPSRAM1_BASE_S                      (SRAMS_BASE_S + 0x000C0000UL)   /*!< Base address of : Low Power System RAM                   */
#define LPSRAM2_BASE_S                      (SRAMS_BASE_S + 0x000C2000UL)   /*!< Base address of : Low Power System RAM                   */
#define LPSRAM3_BASE_S                      (SRAMS_BASE_S + 0x000C4000UL)   /*!< Base address of : Low Power System RAM                   */

#define BKP_SRAM_BASE_S                     (0x52000000UL)  /*!< Base address of : CAN static  RAM                              */
#define CAN_SRAM_BASE_S                     (0x50310000UL)  /*!< Base address of : backup static  RAM                           */

#define SRAMS_FETCH_BASE_S                  (0x0E000000UL)  /*!< Base address of : SRAMs region for CM33 instruction fetch      */

/*!< Peripherals buses Secure aliases */
#define APB1_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x00000000UL)
#define APB2_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x00200000UL)
#define AHB2_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x00400000UL)
#define AHB3_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x02000000UL)
#define APB3_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x04000000UL)
#define AHB4_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x04200000UL)
#define SMART_RUN_APB_PERIPH_BASE_S        (PERIPH_BASE_S + 0x06000000UL)
#define SMART_RUN_AHB_PERIPH_BASE_S        (PERIPH_BASE_S + 0x06200000UL)
#define APB4_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x08000000UL)
#define AHB5_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x08200000UL)
#define APB_DEBUG_PERIPH_BASE_S            (PERIPH_BASE_S + 0x0A000000UL)
#define AHB6_PERIPH_BASE_S                 (PERIPH_BASE_S + 0x0B000000UL)

/*!< APB1 peripherals Secure aliases */
#define TIM2_BASE_S                         (APB1_PERIPH_BASE_S + 0x000000UL)
#define TIM3_BASE_S                         (APB1_PERIPH_BASE_S + 0x010000UL)
#define TIM4_BASE_S                         (APB1_PERIPH_BASE_S + 0x020000UL)
#define TIM5_BASE_S                         (APB1_PERIPH_BASE_S + 0x030000UL)
#define TIM6_BASE_S                         (APB1_PERIPH_BASE_S + 0x040000UL)
#define TIM7_BASE_S                         (APB1_PERIPH_BASE_S + 0x050000UL)
#define TIM12_BASE_S                        (APB1_PERIPH_BASE_S + 0x060000UL)
#define TIM13_BASE_S                        (APB1_PERIPH_BASE_S + 0x070000UL)
#define TIM14_BASE_S                        (APB1_PERIPH_BASE_S + 0x080000UL)
#define LPTIM1_BASE_S                       (APB1_PERIPH_BASE_S + 0x090000UL)
#define LPTIM2_BASE_S                       (APB1_PERIPH_BASE_S + 0x0A0000UL)
#define SPI2_BASE_S                         (APB1_PERIPH_BASE_S + 0x0B0000UL)
#define SPI3_BASE_S                         (APB1_PERIPH_BASE_S + 0x0C0000UL)
#define SPDIFRX_BASE_S                      (APB1_PERIPH_BASE_S + 0x0D0000UL)
#define USART2_BASE_S                       (APB1_PERIPH_BASE_S + 0x0E0000UL)
#define USART3_BASE_S                       (APB1_PERIPH_BASE_S + 0x0F0000UL)
#define UART4_BASE_S                        (APB1_PERIPH_BASE_S + 0x100000UL)
#define UART5_BASE_S                        (APB1_PERIPH_BASE_S + 0x110000UL)
#define I2C1_BASE_S                         (APB1_PERIPH_BASE_S + 0x120000UL)
#define I2C2_BASE_S                         (APB1_PERIPH_BASE_S + 0x130000UL)
#define I2C3_BASE_S                         (APB1_PERIPH_BASE_S + 0x140000UL)
#define I2C4_BASE_S                         (APB1_PERIPH_BASE_S + 0x150000UL)
#define I2C5_BASE_S                         (APB1_PERIPH_BASE_S + 0x160000UL)
#define I2C6_BASE_S                         (APB1_PERIPH_BASE_S + 0x170000UL)
#define I2C7_BASE_S                         (APB1_PERIPH_BASE_S + 0x180000UL)
#define I3C1_BASE_S                         (APB1_PERIPH_BASE_S + 0x190000UL)
#define I3C2_BASE_S                         (APB1_PERIPH_BASE_S + 0x1A0000UL)
#define I3C3_BASE_S                         (APB1_PERIPH_BASE_S + 0x1B0000UL)
#define TIM10_BASE_S                        (APB1_PERIPH_BASE_S + 0x1C0000UL)
#define TIM11_BASE_S                        (APB1_PERIPH_BASE_S + 0x1D0000UL)

/*!< APB2 peripherals Secure aliases */
#define TIM1_BASE_S                         (APB2_PERIPH_BASE_S + 0x000000UL)
#define TIM8_BASE_S                         (APB2_PERIPH_BASE_S + 0x010000UL)
#define USART6_BASE_S                       (APB2_PERIPH_BASE_S + 0x020000UL)
#define SPI1_BASE_S                         (APB2_PERIPH_BASE_S + 0x030000UL)
#define SPI4_BASE_S                         (APB2_PERIPH_BASE_S + 0x040000UL)
#define TIM15_BASE_S                        (APB2_PERIPH_BASE_S + 0x050000UL)
#define TIM16_BASE_S                        (APB2_PERIPH_BASE_S + 0x060000UL)
#define TIM17_BASE_S                        (APB2_PERIPH_BASE_S + 0x070000UL)
#define SPI5_BASE_S                         (APB2_PERIPH_BASE_S + 0x080000UL)
#define SAI1_BASE_S                         (APB2_PERIPH_BASE_S + 0x090000UL)
#define SAI1_Block_A_BASE_S                 (SAI1_BASE_S + 0x004UL)
#define SAI1_Block_B_BASE_S                 (SAI1_BASE_S + 0x024UL)
#define SAI2_BASE_S                         (APB2_PERIPH_BASE_S + 0x0A0000UL)
#define SAI2_Block_A_BASE_S                 (SAI2_BASE_S + 0x004UL)
#define SAI2_Block_B_BASE_S                 (SAI2_BASE_S + 0x024UL)
#define SAI3_BASE_S                         (APB2_PERIPH_BASE_S + 0x0B0000UL)
#define SAI3_Block_A_BASE_S                 (SAI3_BASE_S + 0x004UL)
#define SAI3_Block_B_BASE_S                 (SAI3_BASE_S + 0x024UL)
#define UART9_BASE_S                        (APB2_PERIPH_BASE_S + 0x0C0000UL)
#define FDCAN1_BASE_S                       (APB2_PERIPH_BASE_S + 0x0D0000UL)
#define FDCAN2_BASE_S                       (APB2_PERIPH_BASE_S + 0x0E0000UL)
#define FDCAN3_BASE_S                       (APB2_PERIPH_BASE_S + 0x0F0000UL)
#define CANCU_BASE_S                        (APB2_PERIPH_BASE_S + 0x100000UL)
#define CANSRAM_BASE_S                      (APB2_PERIPH_BASE_S + 0x110000UL)
#define TIM20_BASE_S                        (APB2_PERIPH_BASE_S + 0x120000UL)
#define USART1_BASE_S                       (APB2_PERIPH_BASE_S + 0x130000UL)
#define SAI4_BASE_S                         (APB2_PERIPH_BASE_S + 0x140000UL)
#define SAI4_Block_A_BASE_S                 (SAI4_BASE_S + 0x004UL)
#define SAI4_Block_B_BASE_S                 (SAI4_BASE_S + 0x024UL)
#define SPI6_BASE_S                         (APB2_PERIPH_BASE_S + 0x150000UL)
#define SPI7_BASE_S                         (APB2_PERIPH_BASE_S + 0x160000UL)
#define UART7_BASE_S                        (APB2_PERIPH_BASE_S + 0x170000UL)
#define UART8_BASE_S                        (APB2_PERIPH_BASE_S + 0x180000UL)

/*!< AHB2 peripherals Secure aliases */
#define HPDMA1_BASE_S                       (AHB2_PERIPH_BASE_S + 0x000000UL)
#define HPDMA2_BASE_S                       (AHB2_PERIPH_BASE_S + 0x010000UL)
#define HPDMA3_BASE_S                       (AHB2_PERIPH_BASE_S + 0x020000UL)
#define OCTOSPI1_BASE_S                     (AHB2_PERIPH_BASE_S + 0x030000UL)
#define OCTOSPI2_BASE_S                     (AHB2_PERIPH_BASE_S + 0x040000UL)
#define ICACHE_BASE_S                       (AHB2_PERIPH_BASE_S + 0x070000UL)
#define DCACHE_BASE_S                       (AHB2_PERIPH_BASE_S + 0x080000UL)
#define IPCC1_BASE_S                        (AHB2_PERIPH_BASE_S + 0x090000UL)
#define IPCC1_C1_BASE_S                     (IPCC1_BASE_S)
#define IPCC1_C2_BASE_S                     (IPCC1_BASE_S + 0x10UL)
#define DCMI_BASE_S                         (AHB2_PERIPH_BASE_S + 0x0A0000UL)
#define PSSI_BASE_S                         (AHB2_PERIPH_BASE_S + 0x0B0000UL)
#define CRC_BASE_S                          (AHB2_PERIPH_BASE_S + 0x0C0000UL)
#define MDF1_BASE_S                         (AHB2_PERIPH_BASE_S + 0x0D0000UL)
#define MDF1_Filter0_BASE_S                 (MDF1_BASE_S + 0x80UL)
#define MDF1_Filter1_BASE_S                 (MDF1_BASE_S + 0x100UL)
#define MDF1_Filter2_BASE_S                 (MDF1_BASE_S + 0x180UL)
#define MDF1_Filter3_BASE_S                 (MDF1_BASE_S + 0x200UL)
#define MDF1_Filter4_BASE_S                 (MDF1_BASE_S + 0x280UL)
#define MDF1_Filter5_BASE_S                 (MDF1_BASE_S + 0x300UL)
#define MDF1_Filter6_BASE_S                 (MDF1_BASE_S + 0x380UL)
#define MDF1_Filter7_BASE_S                 (MDF1_BASE_S + 0x400UL)
#define ADC1_BASE_S                         (AHB2_PERIPH_BASE_S + 0x0E0000UL)
#define ADC2_BASE_S                         (AHB2_PERIPH_BASE_S + 0x0E0100UL)
#define ADC12_COMMON_BASE_S                 (AHB2_PERIPH_BASE_S + 0x0E0300UL)
#define ADC3_BASE_S                         (AHB2_PERIPH_BASE_S + 0x0F0000UL)
#define ADC3_COMMON_BASE_S                  (AHB2_PERIPH_BASE_S + 0x0F0300UL)
#define OCTOSPIM_BASE_S                     (AHB2_PERIPH_BASE_S + 0x100000UL)

#define HPDMA1_Channel0_BASE_S              (HPDMA1_BASE_S + 0x0050UL)
#define HPDMA1_Channel1_BASE_S              (HPDMA1_BASE_S + 0x00D0UL)
#define HPDMA1_Channel2_BASE_S              (HPDMA1_BASE_S + 0x0150UL)
#define HPDMA1_Channel3_BASE_S              (HPDMA1_BASE_S + 0x01D0UL)
#define HPDMA1_Channel4_BASE_S              (HPDMA1_BASE_S + 0x0250UL)
#define HPDMA1_Channel5_BASE_S              (HPDMA1_BASE_S + 0x02D0UL)
#define HPDMA1_Channel6_BASE_S              (HPDMA1_BASE_S + 0x0350UL)
#define HPDMA1_Channel7_BASE_S              (HPDMA1_BASE_S + 0x03D0UL)
#define HPDMA1_Channel8_BASE_S              (HPDMA1_BASE_S + 0x0450UL)
#define HPDMA1_Channel9_BASE_S              (HPDMA1_BASE_S + 0x04D0UL)
#define HPDMA1_Channel10_BASE_S             (HPDMA1_BASE_S + 0x0550UL)
#define HPDMA1_Channel11_BASE_S             (HPDMA1_BASE_S + 0x05D0UL)
#define HPDMA1_Channel12_BASE_S             (HPDMA1_BASE_S + 0x0650UL)
#define HPDMA1_Channel13_BASE_S             (HPDMA1_BASE_S + 0x06D0UL)
#define HPDMA1_Channel14_BASE_S             (HPDMA1_BASE_S + 0x0750UL)
#define HPDMA1_Channel15_BASE_S             (HPDMA1_BASE_S + 0x07D0UL)

#define HPDMA2_Channel0_BASE_S              (HPDMA2_BASE_S + 0x0050UL)
#define HPDMA2_Channel1_BASE_S              (HPDMA2_BASE_S + 0x00D0UL)
#define HPDMA2_Channel2_BASE_S              (HPDMA2_BASE_S + 0x0150UL)
#define HPDMA2_Channel3_BASE_S              (HPDMA2_BASE_S + 0x01D0UL)
#define HPDMA2_Channel4_BASE_S              (HPDMA2_BASE_S + 0x0250UL)
#define HPDMA2_Channel5_BASE_S              (HPDMA2_BASE_S + 0x02D0UL)
#define HPDMA2_Channel6_BASE_S              (HPDMA2_BASE_S + 0x0350UL)
#define HPDMA2_Channel7_BASE_S              (HPDMA2_BASE_S + 0x03D0UL)
#define HPDMA2_Channel8_BASE_S              (HPDMA2_BASE_S + 0x0450UL)
#define HPDMA2_Channel9_BASE_S              (HPDMA2_BASE_S + 0x04D0UL)
#define HPDMA2_Channel10_BASE_S             (HPDMA2_BASE_S + 0x0550UL)
#define HPDMA2_Channel11_BASE_S             (HPDMA2_BASE_S + 0x05D0UL)
#define HPDMA2_Channel12_BASE_S             (HPDMA2_BASE_S + 0x0650UL)
#define HPDMA2_Channel13_BASE_S             (HPDMA2_BASE_S + 0x06D0UL)
#define HPDMA2_Channel14_BASE_S             (HPDMA2_BASE_S + 0x0750UL)
#define HPDMA2_Channel15_BASE_S             (HPDMA2_BASE_S + 0x07D0UL)

#define HPDMA3_Channel0_BASE_S              (HPDMA3_BASE_S + 0x0050UL)
#define HPDMA3_Channel1_BASE_S              (HPDMA3_BASE_S + 0x00D0UL)
#define HPDMA3_Channel2_BASE_S              (HPDMA3_BASE_S + 0x0150UL)
#define HPDMA3_Channel3_BASE_S              (HPDMA3_BASE_S + 0x01D0UL)
#define HPDMA3_Channel4_BASE_S              (HPDMA3_BASE_S + 0x0250UL)
#define HPDMA3_Channel5_BASE_S              (HPDMA3_BASE_S + 0x02D0UL)
#define HPDMA3_Channel6_BASE_S              (HPDMA3_BASE_S + 0x0350UL)
#define HPDMA3_Channel7_BASE_S              (HPDMA3_BASE_S + 0x03D0UL)
#define HPDMA3_Channel8_BASE_S              (HPDMA3_BASE_S + 0x0450UL)
#define HPDMA3_Channel9_BASE_S              (HPDMA3_BASE_S + 0x04D0UL)
#define HPDMA3_Channel10_BASE_S             (HPDMA3_BASE_S + 0x0550UL)
#define HPDMA3_Channel11_BASE_S             (HPDMA3_BASE_S + 0x05D0UL)
#define HPDMA3_Channel12_BASE_S             (HPDMA3_BASE_S + 0x0650UL)
#define HPDMA3_Channel13_BASE_S             (HPDMA3_BASE_S + 0x06D0UL)
#define HPDMA3_Channel14_BASE_S             (HPDMA3_BASE_S + 0x0750UL)
#define HPDMA3_Channel15_BASE_S             (HPDMA3_BASE_S + 0x07D0UL)

/*!< AHB3 peripherals Secure aliases */
#define HASH_BASE_S                         (AHB3_PERIPH_BASE_S + 0x010000UL)
#define HASH_DIGEST_BASE_S                  (HASH_BASE_S + 0x310UL)
#define RNG_BASE_S                          (AHB3_PERIPH_BASE_S + 0x020000UL)
#define PKA_BASE_S                          (AHB3_PERIPH_BASE_S + 0x060000UL)
#define RAMCFG_BASE_S                       (AHB3_PERIPH_BASE_S + 0x070000UL)
#define RAMCFG_SYSRAM_BASE_S                (RAMCFG_BASE_S)
#define RAMCFG_SRAM1_BASE_S                 (RAMCFG_BASE_S + 0x000080UL)
#define RAMCFG_SRAM2_BASE_S                 (RAMCFG_BASE_S + 0x000100UL)
#define RAMCFG_RETRAM_BASE_S                (RAMCFG_BASE_S + 0x000180UL)
#define RAMCFG_LPSRAM1_BASE_S               (RAMCFG_BASE_S + 0x000200UL)
#define RAMCFG_LPSRAM2_BASE_S               (RAMCFG_BASE_S + 0x000280UL)
#define RAMCFG_LPSRAM3_BASE_S               (RAMCFG_BASE_S + 0x000300UL)
#define RAMCFG_BKPSRAM_BASE_S               (RAMCFG_BASE_S + 0x000380UL)
#define RAMCFG_VDERAM_BASE_S                (RAMCFG_BASE_S + 0x000400UL)
#define RIFSC_BASE_S                        (AHB3_PERIPH_BASE_S + 0x080000UL)
#define RISC_BASE_S                         (RIFSC_BASE_S)
#define RIMC_BASE_S                         (RIFSC_BASE_S + 0xC00UL)
#define RIFSC_ID_BASE_S                     (RIFSC_BASE_S + 0xFB0UL)
#define IAC_BASE_S                          (AHB3_PERIPH_BASE_S + 0x090000UL)
#define RISAF1_BASE_S                       (AHB3_PERIPH_BASE_S + 0x0A0000UL)
#define RISAF2_BASE_S                       (AHB3_PERIPH_BASE_S + 0x0B0000UL)
#define RISAF4_BASE_S                       (AHB3_PERIPH_BASE_S + 0x0D0000UL)
#define RISAF5_BASE_S                       (AHB3_PERIPH_BASE_S + 0x0E0000UL)
#define RISAB1_BASE_S                       (AHB3_PERIPH_BASE_S + 0x0F0000UL)
#define RISAB2_BASE_S                       (AHB3_PERIPH_BASE_S + 0x100000UL)
#define RISAB3_BASE_S                       (AHB3_PERIPH_BASE_S + 0x110000UL)
#define RISAB4_BASE_S                       (AHB3_PERIPH_BASE_S + 0x120000UL)
#define RISAB5_BASE_S                       (AHB3_PERIPH_BASE_S + 0x130000UL)
#define RISAB6_BASE_S                       (AHB3_PERIPH_BASE_S + 0x140000UL)

