STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253dxx_cm33.h
/*****************  Bit definition for ETH_MTLTBSCR register  *****************/
#define ETH_MTLTBSCR_ESTM_Pos               (0U)
#define ETH_MTLTBSCR_ESTM_Msk               (0x1UL << ETH_MTLTBSCR_ESTM_Pos)                      /*!< 0x00000001 */
#define ETH_MTLTBSCR_ESTM                   ETH_MTLTBSCR_ESTM_Msk                               /*!< EST offset mode */
#define ETH_MTLTBSCR_LEOV_Pos               (1U)
#define ETH_MTLTBSCR_LEOV_Msk               (0x1UL << ETH_MTLTBSCR_LEOV_Pos)                      /*!< 0x00000002 */
#define ETH_MTLTBSCR_LEOV                   ETH_MTLTBSCR_LEOV_Msk                               /*!< Launch expiry offset valid */
#define ETH_MTLTBSCR_LEGOS_Pos              (4U)
#define ETH_MTLTBSCR_LEGOS_Msk              (0x7UL << ETH_MTLTBSCR_LEGOS_Pos)                     /*!< 0x00000070 */
#define ETH_MTLTBSCR_LEGOS                  ETH_MTLTBSCR_LEGOS_Msk                              /*!< Launch Expiry GSN Offset */
#define ETH_MTLTBSCR_LEOS_Pos               (8U)
#define ETH_MTLTBSCR_LEOS_Msk               (0xFFFFFFUL << ETH_MTLTBSCR_LEOS_Pos)                 /*!< 0xFFFFFF00 */
#define ETH_MTLTBSCR_LEOS                   ETH_MTLTBSCR_LEOS_Msk                               /*!< Launch Expiry Offset */

/*****************  Bit definition for ETH_MTLESTCR register  *****************/
#define ETH_MTLESTCR_EEST_Pos               (0U)
#define ETH_MTLESTCR_EEST_Msk               (0x1UL << ETH_MTLESTCR_EEST_Pos)                      /*!< 0x00000001 */
#define ETH_MTLESTCR_EEST                   ETH_MTLESTCR_EEST_Msk                               /*!< Enable EST */
#define ETH_MTLESTCR_SSWL_Pos               (1U)
#define ETH_MTLESTCR_SSWL_Msk               (0x1UL << ETH_MTLESTCR_SSWL_Pos)                      /*!< 0x00000002 */
#define ETH_MTLESTCR_SSWL                   ETH_MTLESTCR_SSWL_Msk                               /*!< Switch to S/W owned list */
#define ETH_MTLESTCR_DDBF_Pos               (4U)
#define ETH_MTLESTCR_DDBF_Msk               (0x1UL << ETH_MTLESTCR_DDBF_Pos)                      /*!< 0x00000010 */
#define ETH_MTLESTCR_DDBF                   ETH_MTLESTCR_DDBF_Msk                               /*!< Do not Drop frames during Frame Size Error */
#define ETH_MTLESTCR_DFBS_Pos               (5U)
#define ETH_MTLESTCR_DFBS_Msk               (0x1UL << ETH_MTLESTCR_DFBS_Pos)                      /*!< 0x00000020 */
#define ETH_MTLESTCR_DFBS                   ETH_MTLESTCR_DFBS_Msk                               /*!< Drop Frames causing Scheduling Error */
#define ETH_MTLESTCR_LCSE_Pos               (6U)
#define ETH_MTLESTCR_LCSE_Msk               (0x3UL << ETH_MTLESTCR_LCSE_Pos)                      /*!< 0x000000C0 */
#define ETH_MTLESTCR_LCSE                   ETH_MTLESTCR_LCSE_Msk                               /*!< Loop Count to report Scheduling Error */
#define ETH_MTLESTCR_TILS_Pos               (8U)
#define ETH_MTLESTCR_TILS_Msk               (0x7UL << ETH_MTLESTCR_TILS_Pos)                      /*!< 0x00000700 */
#define ETH_MTLESTCR_TILS                   ETH_MTLESTCR_TILS_Msk                               /*!< Time Interval Left Shift Amount */
#define ETH_MTLESTCR_CTOV_Pos               (12U)
#define ETH_MTLESTCR_CTOV_Msk               (0xFFFUL << ETH_MTLESTCR_CTOV_Pos)                    /*!< 0x00FFF000 */
#define ETH_MTLESTCR_CTOV                   ETH_MTLESTCR_CTOV_Msk                               /*!< Current Time Offset Value */
#define ETH_MTLESTCR_PTOV_Pos               (24U)
#define ETH_MTLESTCR_PTOV_Msk               (0xFFUL << ETH_MTLESTCR_PTOV_Pos)                     /*!< 0xFF000000 */
#define ETH_MTLESTCR_PTOV                   ETH_MTLESTCR_PTOV_Msk                               /*!< PTP Time Offset Value */

/****************  Bit definition for ETH_MTLESTECR register  *****************/
#define ETH_MTLESTECR_OVHD_Pos              (0U)
#define ETH_MTLESTECR_OVHD_Msk              (0x3FUL << ETH_MTLESTECR_OVHD_Pos)                    /*!< 0x0000003F */
#define ETH_MTLESTECR_OVHD                  ETH_MTLESTECR_OVHD_Msk                              /*!< Overhead Bytes Value */

/*****************  Bit definition for ETH_MTLESTSR register  *****************/
#define ETH_MTLESTSR_SWLC_Pos               (0U)
#define ETH_MTLESTSR_SWLC_Msk               (0x1UL << ETH_MTLESTSR_SWLC_Pos)                      /*!< 0x00000001 */
#define ETH_MTLESTSR_SWLC                   ETH_MTLESTSR_SWLC_Msk                               /*!< Switch to S/W owned list Complete */
#define ETH_MTLESTSR_BTRE_Pos               (1U)
#define ETH_MTLESTSR_BTRE_Msk               (0x1UL << ETH_MTLESTSR_BTRE_Pos)                      /*!< 0x00000002 */
#define ETH_MTLESTSR_BTRE                   ETH_MTLESTSR_BTRE_Msk                               /*!< BTR Error */
#define ETH_MTLESTSR_HLBF_Pos               (2U)
#define ETH_MTLESTSR_HLBF_Msk               (0x1UL << ETH_MTLESTSR_HLBF_Pos)                      /*!< 0x00000004 */
#define ETH_MTLESTSR_HLBF                   ETH_MTLESTSR_HLBF_Msk                               /*!< Head-Of-Line Blocking due to Frame Size */
#define ETH_MTLESTSR_HLBS_Pos               (3U)
#define ETH_MTLESTSR_HLBS_Msk               (0x1UL << ETH_MTLESTSR_HLBS_Pos)                      /*!< 0x00000008 */
#define ETH_MTLESTSR_HLBS                   ETH_MTLESTSR_HLBS_Msk                               /*!< Head-Of-Line Blocking due to Scheduling */
#define ETH_MTLESTSR_CGCE_Pos               (4U)
#define ETH_MTLESTSR_CGCE_Msk               (0x1UL << ETH_MTLESTSR_CGCE_Pos)                      /*!< 0x00000010 */
#define ETH_MTLESTSR_CGCE                   ETH_MTLESTSR_CGCE_Msk                               /*!< Constant Gate Control Error */
#define ETH_MTLESTSR_SWOL_Pos               (7U)
#define ETH_MTLESTSR_SWOL_Msk               (0x1UL << ETH_MTLESTSR_SWOL_Pos)                      /*!< 0x00000080 */
#define ETH_MTLESTSR_SWOL                   ETH_MTLESTSR_SWOL_Msk                               /*!< S/W owned list */
#define ETH_MTLESTSR_BTRL_Pos               (8U)
#define ETH_MTLESTSR_BTRL_Msk               (0xFFUL << ETH_MTLESTSR_BTRL_Pos)                     /*!< 0x0000FF00 */
#define ETH_MTLESTSR_BTRL                   ETH_MTLESTSR_BTRL_Msk                               /*!< BTR Error Loop Count */
#define ETH_MTLESTSR_CGSN_Pos               (16U)
#define ETH_MTLESTSR_CGSN_Msk               (0xFUL << ETH_MTLESTSR_CGSN_Pos)                      /*!< 0x000F0000 */
#define ETH_MTLESTSR_CGSN                   ETH_MTLESTSR_CGSN_Msk                               /*!< Current GCL slot number */

